---
kind: method
id: M:Autodesk.Revit.DB.ReferenceArrayArrayIterator.#ctor
source: html/080876c7-76b1-9ff8-1d66-c37e8c895e82.htm
---
# Autodesk.Revit.DB.ReferenceArrayArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public ReferenceArrayArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.